{
  "name": "Hercules Konsoulas",
  "label": "Software Engineer",
  "image_path": "img/Herck smallest.jpg",
  "contact": {
    "email": "dyka3773@gmail.com",
    "phone": [
      "+49 1726340553",
      "+30 6978515275"
    ],
    "location": "Bonn, Germany"
  },
  "summary": "A dedicated Web Developer with experience in maintaining and enhancing complex JavaEE and Python based applications, complemented by a strong background in technical documentation and client consultation. Passionate about software engineering and mentoring, with a proven track record in academic projects and space technology initiatives.",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/iraklis-konsoulas/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/dyka3773",
      "svg_path": "img/github.svg"
    },
    {
      "label": "Stack Overflow",
      "url": "https://stackoverflow.com/users/15552149/hercules-konsoulas",
      "svg_path": "img/stack-overflow.svg"
    }
  ],
  "work_experience": [
    {
      "company": "European Dynamics",
      "position": "Full Stack Java Web Developer",
      "location": "Berlin, Germany (Remote)",
      "url": "https://www.eurodyn.com/",
      "start_date": "04/10/2022",
      "end_date": "Present",
      "summary": "",
      "highlights": [
        "Developed, maintained and enhanced a web application written in JavaEE and Spring, which is used by the European Commission and whose tech stack also includes Hibernate, JMS, Kafka, and Oracle.",
        "Invented and implemented a tool for the automatic generation of a database diff report between two Oracle databases, using Python, Node.js and Oracle.",
        "Designed the implementation and testing for a tool used for the extraction of avro files saved in an Oracle database, using Python and Oracle.",
        "Invented several tools and scripts for data migration, port forwarding and automated deployment in local Weblogic servers using Python, Docker and shell scripting (PowerShell and bash).",
        "Wrote technical and business documentation for the web application and the tools, as well as user manuals for the end-users.",
        "Maintained and updated a tool for the automatic enrichment of business documents regarding message exchanges, with message examples and technical documentation, using Javascript, Hugo and Webpack."
      ]
    },
    {
      "company": "",
      "position": "High School Informatics Private Tutor",
      "location": "Larissa, Greece (Remote)",
      "url": "",
      "start_date": "10/01/2021",
      "end_date": "10/06/2022",
      "summary": "",
      "highlights": [
        "Taught programming in Python and Pascal to high school students preparing for the university entrance exams."
      ]
    },
    {
      "company": "i-pins.net",
      "position": "Website Maintainer",
      "location": "Thessaloniki, Greece",
      "url": "https://i-pins.net/index.html",
      "start_date": "2016",
      "end_date": "2018",
      "summary": "",
      "highlights": [
        "Maintained and updated the website of the company, which was built using Joomla and the Helix framework."
      ]
    }
  ],
  "projects": [
    {
      "title": "BEAM Research Group",
      "summary": "A research group backed by the Aristotle University of Thessaloniki, focusing on the development and invention of space technology.",
      "url": "https://beamproject.gr",
      "highlights": [
        "Developed a monitoring and real-time data visualization tool for the ground station of the ECOWISE experiment, using Python and Pandas.",
        "Lead the software subteam for the creation of a web application for the real-time visualization of the data collected by the DROPSTAR experiment, using Python, Flask and asyncio.",
        "Designed and implemented the embedded software and serial communication for the DROPSTAR experiment, which was deployed on a Nvidia Jetson Nano, using Python, asyncio, pyserial and various proprietary libraries.",
        "Designed and supported the development of the website of the research group, using WordPress and Elementor.",
        "Lead multiple workshops and lectures on Python programming and space technology."
      ],
      "images": [
        {
          "img_path": "img/rocket-group-photo.jpg",
          "caption": "All the experimenters and researchers involved in the launch of the DROPSTAR experiment."
        },
        {
          "img_path": "img/operations-room.jpg",
          "caption": "The operations room for the launch of the DROPSTAR experiment."
        },
        {
          "img_path": "img/nasa-spaceapps-presentation.jpg",
          "caption": "Presenting BEAM and Space Technology at the NASA Space Apps Challenge 2022."
        }
      ]
    },
    {
      "title": "mvn-tree-visualizer",
      "summary": "A simple command line tool to generate the visualization of the dependency tree of a Maven project in a graphical format.",
      "url": "https://github.com/dyka3773/mvn-tree-visualizer",
      "highlights": ["Developed and published a command line tool in Python that visualizes the dependency tree of a Maven project in a graphical format, using Python and mermaid.js."]
    },
    {
      "title": "WebText2SQL",
      "summary": "A web app that allows users to formulate SQL queries using natural language.",
      "url": "https://github.com/dyka3773/WebText2SQL",
      "highlights": [
        "The app offers a user-friendly interface (similar to any modern prompt client) for users to input natural language queries against a database of their choice.",
        "It allows users to select, insert and delete database connections, and supports SSH tunneling for secure connections.",
        "Uses OpenAI's GPT-4o-mini model to convert natural language queries into SQL queries, which are then executed against the selected database.",
        "Manages its own user authentication and authorization system, allowing users to create accounts and manage their connections.",
        "Supports multiple DBMS, including PostgreSQL, MySQL, and MariaDB.",
        "The project's tech stack included among others Python, FastAPI, Chainlit, OpenAI's GPT-4o-mini model, PostgreSQL, MySQL, SQLAlchemy, Pydantic, and Docker."        
      ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "Umbrella",
      "position": "Programming Tutor",
      "url": "",
      "start_date": "01/01/2020",
      "end_date": "01/06/2020",
      "location": "Thessaloniki, Greece",
      "summary": "A university volunteer group that offers free programming lessons to weaker students.",
      "highlights": [
        "Taught Python programming to first-year students.",
        "Taught Java programming to electrical engineering students."
      ],
      "sidebar_highlights": [ "Python & Java Tutoring"]
    },
    {
      "organization": "NASA Space Apps Challenge 2022",
      "position": "Academic Experts Team Member",
      "url": "https://drive.google.com/file/d/1ZPaii6xxwrr_5E6_4jH4rcZ6D6TEVYZs/view?usp=drive_link",
      "start_date": "10/05/2022",
      "end_date": "03/10/2022",
      "location": "Thessaloniki, Greece",
      "summary": "A global hackathon organized by NASA, focusing on space technology and innovation.",
      "highlights": [
        "Was part of the Academics team, which was in charge of bringing mentors and judges from the academia to help the participants.",
        "Presented BEAM and Space Technology at the event.",
        "Mentored multiple teams on Python programming, web development and organization of their projects."
      ],
      "sidebar_highlights": [
        "In charge of bringing mentors and judges from the academia",
        "Team mentoring on Python and project management"
      ]
    }
  ],
  "education": [
    {
      "institution": "International Hellenic University",
      "location": "Thessaloniki, Greece",
      "url": "https://www.ihu.edu.gr/",
      "degrees": [
        "Bachelor of Informatics Engineering"
      ],
      "gpa_cumulative": "7.53 /10",
      "graduation_date": "2025"
    },
    {
      "institution": "University of Porto",
      "location": "Erasmus+ Exchange Student",
      "url": "https://www.up.pt/portal/en/",
      "degrees": ["Masters of Informatics Engineering"],
      "gpa_cumulative": "18.5 /20"
    }
  ],
  "skills": [
    {
      "name": "Python, Java, Oracle SQL, Git, Kafka, asyncio",
      "proficiency": 100,
      "proficiency_label": "Expert"
    },
    {
      "name": "Flask, FastAPI, Spring, JMS, PostgreSQL, Chainlit",
      "proficiency": 90,
      "proficiency_label": "Advanced"
    },
    {
      "name": "JavaScript, Hibernate, Selenium, Node.js, Docker, MySQL, Spring-Quartz",
      "proficiency": 75,
      "proficiency_label": "Comfortable"
    },
    {
      "name": "bash, Jenkins, jQuery, PowerShell, PHP",
      "proficiency": 60,
      "proficiency_label": "Familiar"
    }
  ],
  "interests": [
    {
      "name": "Escape Rooms",
      "summary": "I love solving puzzles and riddles",
      "images": [
        {
          "img_path": "img/escape-the-vault.jpg",
          "caption": "My most recent escape room in Amsterdam."
        },
        {
          "img_path": "img/counttown.jpg",
          "caption": "My first escape room in my favorite escape room company - Counttown."
        }
      ]
    },
    {
      "name": "Bass Guitar & Music In General",
      "summary": "I love playing the bass guitar and listening to (mostly metal) music.",
      "images": []
    },
    {
      "name": "Travelling",
      "summary": "I love travelling and exploring new places.",
      "images": []
    }
  ],
  "languages": [
    {
      "language": "Greek",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Full professional proficiency (C2)"
    },
    {
      "language": "German",
      "fluency": "Limited working proficiency (B2 but currently studying)"
    },
    {
      "language": "Portuguese",
      "fluency": "Elementary proficiency (A2)"
    }
  ],
  "references": [
  ]
}
